// pages/posts/[slug].js
import Layout from "../../../ui/components/Layout";
import PostTemplate from "../../../ui/components/PostTemplate"

export async function getStaticProps() {
  return {
    props: {
      title: 'Какво направихме през 2023 г. - Сдружение Фонд Жеравна'
    },
  };
}

// Mock Data: Replace this with real data fetching from an API or database.
const post = {
  title: "Какво направихме през 2023 г.",
  description: "",
  content: `
  - Със средствата от членовете на Сдружението, дарители и спомоществуватели, през 2023 год успяхме да постигнем следното:
  - Положихме ударопоглъщаща настилка на детската площадка в центъра на селото и осигурихме боя, с която бяха пребоядисани съоръженията;
  - Поставихме останалата част от указателните табели в началните и крайни точки на екопътеките съответно между Жеравна и Котел;
  - Дарихме материали (улуци, дървен материал и др.) за ремонт на покрива на Народно Читалище „Единство-1870“ – емблематична за селото сграда, построена по проекта и изцяло със средствата на инж.Васил Ранков и дарена на читалищното настоятелство през 1940 год.
  - Предоставихме на читалището мултимедия и екран за ползване.
  - С активното съдействие на отделни членове на Сдружението беше установено неправомерно унищожаване на камбанарията на църквата на Жеравна „Св. Николай“, данните бяха предадени на съответните държавни органи;
  - Продължихме да оказваме административно съдействие на кмета в действията му свързани със съхраняване и подобряване облика на селото, подмяна на непрекъснато повреждащата се ВиК мрежа, и  т.н.
  - За 5-та поредна година издадохме календар „Жеравна“, който разпространяваме срещу дарения и средствата от тях използваме съгласно устава на Сдружението.
  `,
};

export default function YearOverview2023() {
  return (
    <Layout>
      <PostTemplate post={post} />
    </Layout>
  );
}