// pages/posts/[slug].js
import Layout from "../../ui/components/Layout";
import PostTemplate from "../../ui/components/PostTemplate"

export async function getStaticProps() {
  return {
    props: {
      title: 'Фонд Жеравна преиздаде книгата ЖЕРАВНА от Д. Константинов - Сдружение Фонд Жеравна',
      thumbnail: '/img/book.jpg'
    },
  };
}

// Mock Data: Replace this with real data fetching from an API or database.
const post = {
  title: "Фонд Жеравна преиздаде книгата ЖЕРАВНА от Д. Константинов",
  thumbnail: "/img/book.jpg",
  description: "",
  date: "2024-12-18",
  content: `
  #### Ново издание на „Жеравна в миналото и до днешно време“

  Излезе от печат ново издание на фундаменталния труд на Данаил Константинов „Жеравна в миналото и до днешно време“, издаден през 1948 г. от читалище Единство – с. Жеравна.

  Фонд Жеравна, в сътрудничество с издателство Атеа, издава книгата без почти никаква промяна от оригиналното издание от 1948 г., като единствената промяна е осъвременената корица. Книгата е с твърди корици и е напечатана на качествена бяла офсетова хартия.

  ---

  ### **ВНИМАНИЕ!**

  Книгата **не се продава!** Можете да я получите като подарък, ако направите дарение на името на Фонда на стойност минимум **50 лева** + разходите за изпращане на книгата до Вас:

  - **6 лв.** за България  
  - **20 лв.** за чужбина  

  ---

  ### Как да получите книгата?

  ##### 1. **Чрез банков превод**:
  Направете дарение по банковата сметка на Фонда, и ние ще Ви изпратим книгата.  
  ##### 2. **На място в Жеравна**  
  Можете да я получите в:  
    - Сувенирен магазин **Дюкянъ**  
    - **Ретро Фото**  
    - **Тъкачницата** срещу кметството 
  `,
};

export default function Book() {
  return (
    <Layout>
      <PostTemplate post={post} />
    </Layout>
  );
}